DataProcessors/ИнтеграцияРаботаРу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияРаботаРу</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркерДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияМаркераДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСайта</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркерОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИнтеграцияРаботаРу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция Сайт() Экспорт
	
	Возврат Справочники.ИсточникиИнформацииОКандидатах.РаботаРу;
	
КонецФункции

// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  ОбработкаОбъект.ИнтеграцияРаботаРу
Функция НовыйМенеджер(Пользователь) Экспорт
	
	Менеджер = Создать();
	
	Менеджер.Сайт = Сайт();
	Менеджер.Пользователь = Пользователь;
	Менеджер.ДанныеСайта = ДанныеСайта();
	
	Возврат Менеджер;
	
КонецФункции

Функция ДанныеСайта() Экспорт
	
	ДанныеСайта = РекрутинговыеСайтыСлужебный.НовыеДанныеСайта();
	
	ДанныеСайта.Имя = Имя();
	ДанныеСайта.ИмяСайта = ИмяСайта();
	ДанныеСайта.Представление = Представление();
	ДанныеСайта.АдресЗапроса = АдресЗапроса();
	ДанныеСайта.ГлавнаяСтраница = ГлавнаяСтраница();
	ДанныеСайта.Логотип = Логотип();
	ДанныеСайта.ДоступенПоискРезюме = Ложь;
	
	// АПК:1297-выкл Классификаторы, загруженные с сайта. Не локализуется
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Еврейская автономная область", "Еврейская АО");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Чувашия / Чувашская республика", "Чувашская республика");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Ханты-Мансийский Автономный округ - Югра АО", "Ханты-Мансийский АО - Югра");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Республика Чеченская", "Чеченская республика");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Республика Саха /Якутия/", "Республика Саха");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Республика Карачаево-Черкессия","Карачаево-Черкесская республика");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Республика Кабардино-Балкария", "Кабардино-Балкарская республика");
	// АПК:1297-Вкл
	
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("operating_schedule", "schedules");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("skills", "skills");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("specializations", "specializations");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("work_hour_id", "work_hours");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("employment_id", "employments");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("work_schedule_id", "work_schedules");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("regions", "regions");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("places", "workplaces");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("experience", "experiences");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("education", "educations");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("professional_areas", "professional_areas");
	
	ДанныеСайта.ИменаПутейКДаннымВакансии.Вакансия = "title";
	ДанныеСайта.ИменаПутейКДаннымВакансии.Адрес = "link";
	ДанныеСайта.ИменаПутейКДаннымВакансии.Идентификатор = "id";
	
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.Наименование = "title";
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.ПредполагаемыйДоход = "salary.to";
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.Описание = "description";
	
	ДанныеСайта.ШаблоныСтраницСайта.Сайт = Сайт();
	ДанныеСайта.ШаблоныСтраницСайта.Логотип = Логотип();
	ДанныеСайта.ШаблоныСтраницСайта.ГлавнаяСтраница = ГлавнаяСтраница();
	ДанныеСайта.ШаблоныСтраницСайта.ШаблонURLРезюме = "https://*.rabota.ru/*esume*";
	ДанныеСайта.ШаблоныСтраницСайта.РегулярноеВыражениеURLСайта = "https:\/\/((.*?\.rabota)|(rabota))\.ru\/.*";
	ДанныеСайта.ШаблоныСтраницСайта.РегулярноеВыражениеURLРезюме = "https:\/\/((.*?\.rabota)|(rabota))\.ru\/.*?(R|r)esume.\d.*?.html.*";
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляРаботаРу();
	АдресАвторизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1?app_id=%2&scope=profile,vacancies&display=page&redirect_uri=%3",
				ИдентификаторПриложения.auth_uri,
				ИдентификаторПриложения.client_id,
				ИдентификаторПриложения.redirect_uri);
	ДанныеСайта.АдресАвторизации = АдресАвторизации;
	
	ЗаполнитьПараметрыФорм(ДанныеСайта);
	
	Возврат ДанныеСайта;
	
КонецФункции

#Область Интерфейс

// Параметры:
//  АдресаСайтов - Массив Из см. РекрутинговыеСайтыСлужебный.ОписаниеАдресаРекрутинговогоСайта
Процедура ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов) Экспорт
	
	АдресаСайтов.Добавить(
		РекрутинговыеСайтыСлужебный.ОписаниеАдресаРекрутинговогоСайта(Представление(), АдресЗапроса()));
	
КонецПроцедуры

Функция Подключить(МенеджерСайта, ПараметрыПодключения) Экспорт
	
	Возврат МенеджерСайта.Подключить(ПараметрыПодключения.КодАвторизации);
	
КонецФункции

// Параметры:
//  МенеджерСайта - См. НовыйМенеджер
//  Показыватьпредупреждение - Булево -
// 
// Возвращаемое значение:
//  Структура - см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция ПроверитьПодключение(МенеджерСайта, Показыватьпредупреждение = Истина) Экспорт
	
	Возврат МенеджерСайта.ПроверитьПодключение(Показыватьпредупреждение);
	
КонецФункции

Функция ЗагрузитьКлассификаторы(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ЗагрузитьКлассификаторы();
	
КонецФункции

Функция СайтДоступен(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.СайтДоступен();
	
КонецФункции

Функция ИдентификаторРезюмеПоАдресу(МенеджерСайта, Знач АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
КонецФункции

Функция ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме) Экспорт
	
	Возврат МенеджерСайта.ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме);
	
КонецФункции

Функция СтруктураРезюмеССайта(МенеджерСайта, ИдентификаторРезюме) Экспорт
	
	Возврат МенеджерСайта.СтруктураРезюмеССайта(ИдентификаторРезюме);
	
КонецФункции

Функция ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение) Экспорт
	
	Возврат МенеджерСайта.ЭлементКлассификатора(ИмяСписка, Значение);
	
КонецФункции

Функция ИнформацияОПользователе(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ИнформацияОПользователе();
	
КонецФункции

Функция ВакансииССайта(МенеджерСайта, БылиОшибки) Экспорт
	
	Возврат МенеджерСайта.ВакансииССайта(БылиОшибки);
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит) Экспорт
	
	Возврат МенеджерСайта.ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит);
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	МенеджерСайта.ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта);
	
КонецПроцедуры

Функция ВидыПолей(МенеджерСайта, ОбновлениеПубликации) Экспорт
	
	Возврат МенеджерСайта.ВидыПолей(ОбновлениеПубликации);
	
КонецФункции

Функция СписокВыбораПоКлассификатору(МенеджерСайта, Путь) Экспорт
	
	Возврат МенеджерСайта.СписокВыбораПоКлассификатору(Путь);
	
КонецФункции

Процедура ПолучитьОтклики(МенеджерСайта, Вакансия) Экспорт
	
	МенеджерСайта.ПолучитьОтклики(Вакансия);
	
КонецПроцедуры

Функция ПоляВакансии(МенеджерСайта, ОбновлениеПубликации = Ложь, ПовторнаяПубликация = Ложь) Экспорт
	
	Возврат МенеджерСайта.ПоляВакансии(ОбновлениеПубликации);
	
КонецФункции

Функция АдресВакансии(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.АдресВакансии(ИдентификаторВакансии);
	
КонецФункции

Функция ОпубликоватьВакансию(МенеджерСайта, Дерево) Экспорт
	
	Возврат МенеджерСайта.ОпубликоватьВакансию(Дерево);
	
КонецФункции

Функция ПрименитьТарифКВакансии(МенеджерСайта, Идентификатор, Тариф) Экспорт
	
	Возврат МенеджерСайта.ПрименитьТарифКВакансии(Идентификатор, Тариф);
	
КонецФункции

Функция ПовторноОпубликоватьВакансию(МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.ПовторноОпубликоватьВакансию(Дерево, Вакансия, ИдентификаторВакансии);
	
КонецФункции

Функция ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии);
	
КонецФункции

Функция СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.СнятьПубликациюВакансии(ИдентификаторВакансии);
	
КонецФункции

Функция СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии);
	
КонецФункции

Процедура ЗагрузитьКомментарииКандидата(МенеджерСайта, Кандидат, ДанныеРезюме) Экспорт
	
	МенеджерСайта.ЗагрузитьКомментарииКандидата(Кандидат, ДанныеРезюме);
	
КонецПроцедуры

Функция ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево) Экспорт
	
	Возврат МенеджерСайта.ЗаполнитьДеревоКлассификатора(Классификатор, Дерево);
	
КонецФункции

Функция ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.ДоступныеДляПолученияКонтакты(АдресРезюме);
	
КонецФункции

Функция КонтактыРезюме(МенеджерСайта, АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.КонтактыРезюме(АдресРезюме);
	
КонецФункции

Функция УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки) Экспорт
	
	Возврат МенеджерСайта.УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки);
	
КонецФункции

Функция ОтправитьОбратнуюСвязьПоОтклику(МенеджерСайта, ДанныеДляОтправки) Экспорт
	
	Возврат МенеджерСайта.ОтправитьОбратнуюСвязьПоОтклику(ДанныеДляОтправки);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Имя()
	
	Возврат "Rabota";
	
КонецФункции

Функция ИмяСайта()
	
	Возврат "rabota.ru";
	
КонецФункции

Функция Представление()
	
	Возврат НСтр("ru = 'Работа.ру'");
	
КонецФункции

Функция АдресЗапроса()
	
	Возврат "api.rabota.ru";
	
КонецФункции

Функция ГлавнаяСтраница()
	
	 Возврат "https://www.rabota.ru/";
	
КонецФункции

Функция Логотип()
	
	Возврат БиблиотекаКартинок.РаботаРу;
	
КонецФункции

Процедура ЗаполнитьПараметрыФорм(ДанныеСайта)
	
	ДанныеСайта.ПараметрыФорм.НастройкаДоступа.ВыводитьКодАвторизации = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
